YCSB/ycsb_20251115_1208/10w_workloada_run.log
/usr/bin/java  -classpath /home/ldy/src/YCSB/conf:/home/ldy/src/YCSB/core/target/core-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/rocksdb-binding-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/rocksdbjni-5.11.3.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/workloads/workloada -threads 40 -p operationcount=100000000 -p rocksdb.dir=/mnt/test
Command line: -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/workloads/workloada -threads 40 -p operationcount=100000000 -p rocksdb.dir=/mnt/test
YCSB Client 0.17.0

Loading workload...
Starting test.
[Thread-34] INFO site.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /mnt/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
[OVERALL], RunTime(ms), 28883
[OVERALL], Throughput(ops/sec), 3462244.226707752
[TOTAL_GCS_G1_Young_Generation], Count, 69
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 103
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.35661115535089843
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 69
[TOTAL_GC_TIME], Time(ms), 103
[TOTAL_GC_TIME_%], Time(%), 0.35661115535089843
[UPDATE-FAILED], Operations, 50004580
[UPDATE-FAILED], AverageLatency(us), 0.6031201141975395
[UPDATE-FAILED], MinLatency(us), 0
[UPDATE-FAILED], MaxLatency(us), 33311
[UPDATE-FAILED], 95thPercentileLatency(us), 2
[UPDATE-FAILED], 99thPercentileLatency(us), 3
[READ], Operations, 0
[READ], AverageLatency(us), NaN
[READ], MinLatency(us), 9223372036854775807
[READ], MaxLatency(us), 0
[READ], 95thPercentileLatency(us), 0
[READ], 99thPercentileLatency(us), 0
[READ], Return=NOT_FOUND, 49995420
[CLEANUP], Operations, 40
[CLEANUP], AverageLatency(us), 262.35
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 10343
[CLEANUP], 95thPercentileLatency(us), 8
[CLEANUP], 99thPercentileLatency(us), 10343
[READ-FAILED], Operations, 49995420
[READ-FAILED], AverageLatency(us), 0.5675275055195056
[READ-FAILED], MinLatency(us), 0
[READ-FAILED], MaxLatency(us), 33919
[READ-FAILED], 95thPercentileLatency(us), 2
[READ-FAILED], 99thPercentileLatency(us), 3
[UPDATE], Operations, 0
[UPDATE], AverageLatency(us), NaN
[UPDATE], MinLatency(us), 9223372036854775807
[UPDATE], MaxLatency(us), 0
[UPDATE], 95thPercentileLatency(us), 0
[UPDATE], 99thPercentileLatency(us), 0
[UPDATE], Return=NOT_FOUND, 50004580