YCSB/ycsb_20251115_1208/10w_workloadc_run.log
/usr/bin/java  -classpath /home/ldy/src/YCSB/conf:/home/ldy/src/YCSB/core/target/core-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/rocksdb-binding-0.17.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/rocksdbjni-5.11.3.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/ldy/src/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/workloads/workloadc -threads 40 -p operationcount=100000000 -p rocksdb.dir=/mnt/test
Command line: -t -db site.ycsb.db.rocksdb.RocksDBClient -P ../../../YCSB/workloads/workloadc -threads 40 -p operationcount=100000000 -p rocksdb.dir=/mnt/test
YCSB Client 0.17.0

Loading workload...
Starting test.
[Thread-13] INFO site.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /mnt/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
[OVERALL], RunTime(ms), 38367
[OVERALL], Throughput(ops/sec), 2606406.5472932467
[TOTAL_GCS_G1_Young_Generation], Count, 55
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 86
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.22415096306721924
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 55
[TOTAL_GC_TIME], Time(ms), 86
[TOTAL_GC_TIME_%], Time(%), 0.22415096306721924
[READ], Operations, 0
[READ], AverageLatency(us), NaN
[READ], MinLatency(us), 9223372036854775807
[READ], MaxLatency(us), 0
[READ], 95thPercentileLatency(us), 0
[READ], 99thPercentileLatency(us), 0
[READ], Return=NOT_FOUND, 100000000
[CLEANUP], Operations, 40
[CLEANUP], AverageLatency(us), 64.6
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 2463
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 2463
[READ-FAILED], Operations, 100000000
[READ-FAILED], AverageLatency(us), 0.67447512
[READ-FAILED], MinLatency(us), 0
[READ-FAILED], MaxLatency(us), 33567
[READ-FAILED], 95thPercentileLatency(us), 2
[READ-FAILED], 99thPercentileLatency(us), 4